//5. Вывести на экран все числа от 1 до 100, которые делятся на 5 без остатка.
public class cycleFor {
    public static void main(String[] args)
    {
        for(int i = 0; i<= 100; i+=5)
        {
            System.out.println(i);
        }
    }
}
